In [16]:
import pandas as pd

In [25]:
def cargar():
  datos = pd.read_csv('/content/drive/MyDrive/datasets/titanic.csv')
  return datos
#datos.head(3)

In [44]:
df=cargar()
df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [27]:
#Eliminar filas que tienen al menos 1 valor faltante
df=cargar()
print(df.sample(4))
print(df.shape)
print('*'*50)
df=df.dropna()
print(df.sample(4))
print(df.shape)
print('*'*50)

     PassengerId  Survived  Pclass                             Name   Sex  \
465          466         0       3  Goncalves, Mr. Manuel Estanslas  male
463          464         0       2     Milling, Mr. Jacob Christian  male
783          784         0       3           Johnston, Mr. Andrew G  male
666          667         0       2      Butler, Mr. Reginald Fenton  male

      Age  SibSp  Parch              Ticket   Fare Cabin Embarked
465  38.0      0      0  SOTON/O.Q. 3101306   7.05   NaN        S
463  48.0      0      0              234360  13.00   NaN        S
783   NaN      1      2          W./C. 6607  23.45   NaN        S
666  25.0      0      0              234686  13.00   NaN        S
(891, 12)
**************************************************
     PassengerId  Survived  Pclass  \
571          572         1       1
572          573         1       1
724          725         1       1
558          559         1       1

                                              Name     Sex   Age  SibSp  \
571  Appleton, Mrs. Edward Dale (Charlotte Lamson)  female  53.0      2
572               Flynn, Mr. John Irwin ("Irving")    male  36.0      0
724                  Chambers, Mr. Norman Campbell    male  27.0      1
558         Taussig, Mrs. Emil (Tillie Mandelbaum)  female  39.0      1

     Parch    Ticket     Fare Cabin Embarked
571      0     11769  51.4792  C101        S
572      0  PC 17474  26.3875   E25        S
724      0    113806  53.1000    E8        S
558      1    110413  79.6500   E67        S
(183, 12)
**************************************************

In [28]:
#Eliminar columnas que tienen al menos 1 valor faltante
df=cargar()
print(df.sample(4))
print(df.shape)
print('*'*50)
df=df.dropna(axis=1)
print(df.sample(4))
print(df.shape)
print('*'*50)

     PassengerId  Survived  Pclass                            Name     Sex  \
82            83         1       3  McDermott, Miss. Brigdet Delia  female
125          126         1       3    Nicola-Yarred, Master. Elias    male
152          153         0       3                Meo, Mr. Alfonzo    male
531          532         0       3               Toufik, Mr. Nakli    male

      Age  SibSp  Parch      Ticket     Fare Cabin Embarked
82    NaN      0      0      330932   7.7875   NaN        Q
125  12.0      1      0        2651  11.2417   NaN        C
152  55.5      0      0  A.5. 11206   8.0500   NaN        S
531   NaN      0      0        2641   7.2292   NaN        C
(891, 12)
**************************************************
     PassengerId  Survived  Pclass                                     Name  \
828          829         1       3             McCormack, Mr. Thomas Joseph
598          599         0       3                        Boulos, Mr. Hanna
291          292         1       1  Bishop, Mrs. Dickinson H (Helen Walton)
844          845         0       3                      Culumovic, Mr. Jeso

        Sex  SibSp  Parch  Ticket     Fare
828    male      0      0  367228   7.7500
598    male      0      0    2664   7.2250
291  female      1      0   11967  91.0792
844    male      0      0  315090   8.6625
(891, 9)
**************************************************

In [29]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'SibSp', 'Parch',
       'Ticket', 'Fare'],
      dtype='object')

In [31]:
#Eliminar solo cuando todos sus valores son nulos
df=cargar()
print(df.sample(4))
print(df.shape)
print('*'*50)
df=df.dropna(axis=0,how='all')#para columnas axis=1
print(df.sample(4))
print(df.shape)
print('*'*50)

     PassengerId  Survived  Pclass                                 Name  \
494          495         0       3           Stanley, Mr. Edward Roland
717          718         1       2  Troutt, Miss. Edwina Celia "Winnie"
208          209         1       3            Carr, Miss. Helen "Ellen"
663          664         0       3                     Coleff, Mr. Peju

        Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
494    male  21.0      0      0  A/4 45380   8.0500   NaN        S
717  female  27.0      0      0      34218  10.5000  E101        S
208  female  16.0      0      0     367231   7.7500   NaN        Q
663    male  36.0      0      0     349210   7.4958   NaN        S
(891, 12)
**************************************************
     PassengerId  Survived  Pclass                             Name     Sex  \
245          246         0       1      Minahan, Dr. William Edward    male
368          369         1       3              Jermyn, Miss. Annie  female
744          745         1       3               Stranden, Mr. Juho    male
604          605         1       1  Homer, Mr. Harry ("Mr E Haven")    male

      Age  SibSp  Parch             Ticket    Fare Cabin Embarked
245  44.0      2      0              19928  90.000   C78        Q
368   NaN      0      0              14313   7.750   NaN        Q
744  31.0      0      0  STON/O 2. 3101288   7.925   NaN        S
604  35.0      0      0             111426  26.550   NaN        C
(891, 12)
**************************************************

In [32]:
#Eliminar si tiene al menos 2 faltantes
df=cargar()
print(df.sample(4))
print(df.shape)
print('*'*50)
df=df.dropna(axis=0,thresh=2)
print(df.sample(4))
print(df.shape)
print('*'*50)

     PassengerId  Survived  Pclass                          Name     Sex  \
456          457         0       1     Millet, Mr. Francis Davis    male
733          734         0       2    Berriman, Mr. William John    male
887          888         1       1  Graham, Miss. Margaret Edith  female
335          336         0       3            Denkoff, Mr. Mitto    male

      Age  SibSp  Parch  Ticket     Fare Cabin Embarked
456  65.0      0      0   13509  26.5500   E38        S
733  23.0      0      0   28425  13.0000   NaN        S
887  19.0      0      0  112053  30.0000   B42        S
335   NaN      0      0  349225   7.8958   NaN        S
(891, 12)
**************************************************
     PassengerId  Survived  Pclass                               Name     Sex  \
689          690         1       1  Madill, Miss. Georgette Alexandra  female
751          752         1       3                Moor, Master. Meier    male
88            89         1       1         Fortune, Miss. Mabel Helen  female
264          265         0       3                 Henry, Miss. Delia  female

      Age  SibSp  Parch  Ticket      Fare        Cabin Embarked
689  15.0      0      1   24160  211.3375           B5        S
751   6.0      0      1  392096   12.4750         E121        S
88   23.0      3      2   19950  263.0000  C23 C25 C27        S
264   NaN      0      0  382649    7.7500          NaN        Q
(891, 12)
**************************************************

In [33]:
#Eliminar por columna especifica o dada
df=cargar()
print(df.sample(4))
print(df.shape)
print('*'*50)
df=df.dropna(subset=['Cabin'])
print(df.sample(4))
print(df.shape)
print('*'*50)

     PassengerId  Survived  Pclass                                     Name  \
744          745         1       3                       Stranden, Mr. Juho
225          226         0       3             Berglund, Mr. Karl Ivar Sven
678          679         0       3  Goodwin, Mrs. Frederick (Augusta Tyler)
302          303         0       3          Johnson, Mr. William Cahoone Jr

        Sex   Age  SibSp  Parch             Ticket    Fare Cabin Embarked
744    male  31.0      0      0  STON/O 2. 3101288   7.925   NaN        S
225    male  22.0      0      0            PP 4348   9.350   NaN        S
678  female  43.0      1      6            CA 2144  46.900   NaN        S
302    male  19.0      0      0               LINE   0.000   NaN        S
(891, 12)
**************************************************
     PassengerId  Survived  Pclass  \
585          586         1       1
879          880         1       1
438          439         0       1
779          780         1       1

                                                  Name     Sex   Age  SibSp  \
585                                Taussig, Miss. Ruth  female  18.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
438                                  Fortune, Mr. Mark    male  64.0      1
779  Robert, Mrs. Edward Scott (Elisabeth Walton Mc...  female  43.0      0

     Parch  Ticket      Fare        Cabin Embarked
585      2  110413   79.6500          E68        S
879      1   11767   83.1583          C50        C
438      4   19950  263.0000  C23 C25 C27        S
779      1   24160  211.3375           B3        S
(204, 12)
**************************************************

In [35]:
#Sustituimos por valor indicado 0
df=cargar()
print(df.sample(4))
print(df.shape)
print('*'*50)
df.fillna('sin datos',inplace=True)
print(df.sample(4))
print(df.shape)
print('*'*50)

     PassengerId  Survived  Pclass                            Name     Sex  \
63            64         0       3           Skoog, Master. Harald    male
702          703         0       3           Barbara, Miss. Saiide  female
226          227         1       2       Mellors, Mr. William John    male
27            28         0       1  Fortune, Mr. Charles Alexander    male

      Age  SibSp  Parch     Ticket      Fare        Cabin Embarked
63    4.0      3      2     347088   27.9000          NaN        S
702  18.0      0      1       2691   14.4542          NaN        C
226  19.0      0      0  SW/PP 751   10.5000          NaN        S
27   19.0      3      2      19950  263.0000  C23 C25 C27        S
(891, 12)
**************************************************
     PassengerId  Survived  Pclass                                  Name  \
33            34         0       2                 Wheadon, Mr. Edward H
436          437         0       3  Ford, Miss. Doolina Margaret "Daisy"
206          207         0       3            Backstrom, Mr. Karl Alfred
465          466         0       3       Goncalves, Mr. Manuel Estanslas

        Sex   Age  SibSp  Parch              Ticket    Fare      Cabin  \
33     male  66.0      0      0          C.A. 24579  10.500  sin datos
436  female  21.0      2      2          W./C. 6608  34.375  sin datos
206    male  32.0      1      0             3101278  15.850  sin datos
465    male  38.0      0      0  SOTON/O.Q. 3101306   7.050  sin datos

    Embarked
33         S
436        S
206        S
465        S
(891, 12)
**************************************************

In [40]:
#Sustituimos con el promedio
df=cargar()
media=df.mean()
print(df.sample(4))
print(df.shape)
print('*'*50)
df.fillna(media,inplace=True)
print(df.sample(4))
print(df.shape)
print('*'*50)

     PassengerId  Survived  Pclass                            Name     Sex  \
346          347         1       2       Smith, Miss. Marion Elsie  female
491          492         0       3             Windelov, Mr. Einar    male
677          678         1       3         Turja, Miss. Anna Sofia  female
82            83         1       3  McDermott, Miss. Brigdet Delia  female

      Age  SibSp  Parch            Ticket     Fare Cabin Embarked
346  40.0      0      0             31418  13.0000   NaN        S
491  21.0      0      0  SOTON/OQ 3101317   7.2500   NaN        S
677  18.0      0      0              4138   9.8417   NaN        S
82    NaN      0      0            330932   7.7875   NaN        Q
(891, 12)
**************************************************
     PassengerId  Survived  Pclass                                Name  \
539          540         1       1  Frolicher, Miss. Hedwig Margaritha
387          388         1       2                    Buss, Miss. Kate
588          589         0       3               Gilinski, Mr. Eliezer
95            96         0       3         Shorney, Mr. Charles Joseph

        Sex        Age  SibSp  Parch  Ticket   Fare Cabin Embarked
539  female  22.000000      0      2   13568  49.50   B39        C
387  female  36.000000      0      0   27849  13.00   NaN        S
588    male  22.000000      0      0   14973   8.05   NaN        S
95     male  29.699118      0      0  374910   8.05   NaN        S
(891, 12)
**************************************************

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  This is separate from the ipykernel package so we can avoid doing imports until

In [41]:
df=cargar()
df.mean()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [42]:
#Sustituimos con valor anterior
df=cargar()
print(df.sample(4))
print(df.shape)
print('*'*50)
df.fillna(method='bfill',inplace=True)
print(df.sample(4))
print(df.shape)
print('*'*50)

     PassengerId  Survived  Pclass                         Name   Sex   Age  \
595          596         0       3  Van Impe, Mr. Jean Baptiste  male  36.0
890          891         0       3          Dooley, Mr. Patrick  male  32.0
703          704         0       3        Gallagher, Mr. Martin  male  25.0
301          302         1       3           McCoy, Mr. Bernard  male   NaN

     SibSp  Parch  Ticket     Fare Cabin Embarked
595      1      1  345773  24.1500   NaN        S
890      0      0  370376   7.7500   NaN        Q
703      0      0   36864   7.7417   NaN        Q
301      2      0  367226  23.2500   NaN        Q
(891, 12)
**************************************************
     PassengerId  Survived  Pclass  \
395          396         0       3
374          375         0       3
498          499         0       1
673          674         1       2

                                                Name     Sex   Age  SibSp  \
395                              Johansson, Mr. Erik    male  22.0      0
374                       Palsson, Miss. Stina Viola  female   3.0      3
498  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0      1
673                            Wilhelms, Mr. Charles    male  31.0      0

     Parch  Ticket      Fare        Cabin Embarked
395      0  350052    7.7958          C78        S
374      1  349909   21.0750          C82        S
498      2  113781  151.5500      C22 C26        S
673      0  244270   13.0000  B51 B53 B55        S
(891, 12)
**************************************************

In [43]:
#Sustituimos con valor posterior
df=cargar()
print(df.sample(4))
print(df.shape)
print('*'*50)
df.fillna(method='ffill',inplace=True)
print(df.sample(4))
print(df.shape)
print('*'*50)

     PassengerId  Survived  Pclass  \
126          127         0       3
84            85         1       2
779          780         1       1
392          393         0       3

                                                  Name     Sex   Age  SibSp  \
126                                McMahon, Mr. Martin    male   NaN      0
84                                 Ilett, Miss. Bertha  female  17.0      0
779  Robert, Mrs. Edward Scott (Elisabeth Walton Mc...  female  43.0      0
392                       Gustafsson, Mr. Johan Birger    male  28.0      2

     Parch      Ticket      Fare Cabin Embarked
126      0      370372    7.7500   NaN        Q
84       0  SO/C 14885   10.5000   NaN        S
779      1       24160  211.3375    B3        S
392      0     3101277    7.9250   NaN        S
(891, 12)
**************************************************
     PassengerId  Survived  Pclass  \
32            33         1       3
121          122         0       3
246          247         0       3
53            54         1       2

                                                  Name     Sex   Age  SibSp  \
32                            Glynn, Miss. Mary Agatha  female  40.0      0
121                         Moore, Mr. Leonard Charles    male  21.0      0
246              Lindahl, Miss. Agda Thorilda Viktoria  female  25.0      0
53   Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...  female  29.0      1

     Parch     Ticket    Fare    Cabin Embarked
32       0     335677   7.750      B78        Q
121      0  A4. 54510   8.050  B58 B60        S
246      0     347071   7.775      C78        S
53       0       2926  26.000      D33        S
(891, 12)
**************************************************